; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 12282)
	(= (fuel plane1) 1051)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at person1 city4)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city6)
	(at person6 city5)
	(at person7 city1)
	(at person8 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 856)
	(= (distance city0 city2) 633)
	(= (distance city0 city3) 508)
	(= (distance city0 city4) 635)
	(= (distance city0 city5) 732)
	(= (distance city0 city6) 728)
	(= (distance city1 city0) 856)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 522)
	(= (distance city1 city3) 514)
	(= (distance city1 city4) 937)
	(= (distance city1 city5) 945)
	(= (distance city1 city6) 593)
	(= (distance city2 city0) 633)
	(= (distance city2 city1) 522)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 922)
	(= (distance city2 city4) 865)
	(= (distance city2 city5) 819)
	(= (distance city2 city6) 935)
	(= (distance city3 city0) 508)
	(= (distance city3 city1) 514)
	(= (distance city3 city2) 922)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 874)
	(= (distance city3 city5) 941)
	(= (distance city3 city6) 518)
	(= (distance city4 city0) 635)
	(= (distance city4 city1) 937)
	(= (distance city4 city2) 865)
	(= (distance city4 city3) 874)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 938)
	(= (distance city4 city6) 663)
	(= (distance city5 city0) 732)
	(= (distance city5 city1) 945)
	(= (distance city5 city2) 819)
	(= (distance city5 city3) 941)
	(= (distance city5 city4) 938)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 635)
	(= (distance city6 city0) 728)
	(= (distance city6 city1) 593)
	(= (distance city6 city2) 935)
	(= (distance city6 city3) 518)
	(= (distance city6 city4) 663)
	(= (distance city6 city5) 635)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city6)
	(at person2 city2)
	(at person3 city1)
	(at person5 city6)
	(at person6 city6)
	(at person7 city1)
	(at person8 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 7
2. (refuel plane1 city4)
   changed: (fuel plane1) from 1051 to 12282
   goals met: 2 of 7
3. (fly plane1 city4 city6)
   deleted: (at plane1 city4)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 0 to 2652, (fuel plane1) from 12282 to 9630
   goals met: 2 of 7
4. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 7
5. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2652 to 5564, (fuel plane1) from 9630 to 6718
   goals met: 3 of 7
6. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 7
7. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 7
8. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 5564 to 8096, (fuel plane1) from 6718 to 4186
   goals met: 3 of 7
9. (debark person2 plane1 city2)
   deleted: (in person2 plane1)
   added: (at person2 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 7
10. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 8096 to 11836, (fuel plane1) from 4186 to 446
   goals met: 4 of 7
11. (refuel plane1 city6)
   changed: (fuel plane1) from 446 to 12282
   goals met: 4 of 7
12. (fly plane1 city6 city1)
   deleted: (at plane1 city6)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 11836 to 14208, (fuel plane1) from 12282 to 9910
   goals met: 4 of 7
13. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 7
14. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 14208 to 17988, (fuel plane1) from 9910 to 6130
   goals met: 5 of 7
15. (board person6 plane1 city5)
   deleted: (at person6 city5)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 7
16. (board person8 plane1 city5)
   deleted: (at person8 city5)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 7
17. (fly plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 17988 to 20528, (fuel plane1) from 6130 to 3590
   goals met: 5 of 7
18. (debark person6 plane1 city6)
   deleted: (in person6 plane1)
   added: (at person6 city6)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 7
19. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 20528 to 23440, (fuel plane1) from 3590 to 678
   goals met: 6 of 7
20. (debark person8 plane1 city0)
   deleted: (in person8 plane1)
   added: (at person8 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 7
